Revit 2026 API

# CeramicCeramicPatternMap Property

---

The property labeled "Image" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicPatternMap { get; }
```
```vb
Public Shared ReadOnly Property CeramicPatternMap As String
	Get
```
```cpp
public:
static property String^ CeramicPatternMap {
	String^ get ();
}
```
```fsharp
static member CeramicPatternMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace